""" 02. Обновление цен товаров

Дан список товаров с ценами.
Программа должна
- применить скидку к каждому товару
- и добавить в список элемент с новой ценой.
- В конце вывести таблицу с новой ценой.

Данные:
products = [["Laptop", 1200], ["Mouse", 25], ["Keyboard", 75], ["Monitor", 200]]
Пример вывода:
Введите скидку (в процентах): 17

Товар          Старая цена    Новая цена
Laptop            1200.00$       996.00$
Mouse               25.00$        20.75$
Keyboard            75.00$        62.25$
Monitor            200.00$       166.00$


02.1 *Задания со звёздочкой:
Вывести результат в таком формате

Товар          Старая цена    Новая цена
Laptop........     $1200.00      $996.00
Mouse.........       $25.00       $20.75
Keyboard......       $75.00       $62.25
Monitor.......      $200.00      $166.00
"""
products = [["Laptop", 1200], ["Mouse", 25], ["Keyboard", 75], ["Monitor", 200]]

discount = 17  # int(input("Введите скидку (в процентах): "))
print('''Товар          Старая цена    Новая цена''')



for item in products:
    old_price = item[1]
    new_price = old_price - (discount * old_price / 100)
    item.append(new_price)
    print(f"{item[0]:.<14}   ${item[1]:^6.2f}       ${new_price:.2f}")



